Revit 2024 API
ITransactionFinalizer Members
The ITransactionFinalizer type exposes the following members.
Methods
Name | Description
OnCommitted
 This method is called at the end of committing a transaction
OnRolledBack
 This method is called at the end of rolling back a transaction
See Also
ITransactionFinalizer Interface
Autodesk.Revit.DB Namespace